Revit 2027 API
BuiltInFailures.ExtendedPropertiesLinkFailures Class
 Extended properties link failures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExtendedPropertiesLinkFailures
Public NotInheritable Class ExtendedPropertiesLinkFailures
public ref class ExtendedPropertiesLinkFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExtendedPropertiesLinkFailures = class end
The BuiltInFailures.ExtendedPropertiesLinkFailures type exposes the following members.
Properties
Name | Description
CannotLoadData |  The extended properties dataset could not be loaded.
CouldNotFindSchema |  The dataset contained a property definition that Revit could not locate.
IncompatibleValue |  The dataset contained a property value that is incompatible with the property definition.
InvalidCategory |  The dataset contains an invalid category in the bindings of property definition.
NoBindings |  The dataset contains invalid binding information for a property definition.
NoUsableSchemas |  The dataset consists of property definitions that Revit does not support. No data could be loaded.
NoValues |  The dataset does not contain any property values.
UnsupportedCategory |  The dataset contains an unsupported category.
UnsupportedSchema |  The dataset contained a property definition that Revit does not support.
Top
See Also
Reference
Autodesk.Revit.DB Namespace